{
  "name": "Bend, OR",
  "slug": "bend-or",
  "region": "Pacific Northwest / High Desert",
  "tagline": "Outdoor recreation mecca with 300 days of sunshine—but diversity is nearly nonexistent and it's expensive",
  "population": "105,000 city / 200,000 metro",
  "scores": {
    "diversity_climate": 3,
    "safety": 7,
    "political_moderation": 6,
    "cost_of_living": 6,
    "walkability": 6,
    "scenic_beauty": 10,
    "climate": 5,
    "culture": 6
  },
  "cost_of_living": {
    "index_vs_national": "3% above national average (housing drove it up)",
    "median_rent_1br": "$1,690",
    "median_rent_2br": "$1,905",
    "vs_la_savings": "$500-900/month compared to LA"
  },
  "diversity": {
    "summary": "⚠️ SEVERE WARNING: Oregon banned Black people from living in the state until the 1920s and had racist constitutional language until 2002. That legacy is alive in Bend. **Murder of Barry Washington (Black teenager) a couple years ago.** Reddit users warn \"there's a ton of racism in Central Oregon\" and \"anyone who says there is not a lot of racism is most likely racist.\" Hate crimes surged 59% in Oregon (2020), 25% more (2022-2023). People report being called racial slurs while hiking. Prineville (nearby) had sundown laws enforced by lynching in the 1970s! City has an Equity Director trying to address issues, and some Black residents say \"it's not so bad,\" but Candace would face regular racism.",
    "diversity_index": "91% White, 0.7% Black, 1.8% Asian, 9% Hispanic (whiteness is a feature, not a bug for many here)",
    "notable": "Murder of Barry Washington; Oregon's Black exclusion laws & sundown town history; hate crimes surging; racial slurs common on trails"
  },
  "safety": {
    "summary": "Generally safe but not exceptional. Violent crime rate around 156 per 100k (below national average), but property crime is higher due to tourism, transient population, and homelessness concerns. Crime fell 13% in 2024. Bend ranks in 32nd percentile for overall safety (safer than 32% of cities). Most neighborhoods feel safe, but not as low-crime as Boise. Would meet Candace's baseline but not exceed it.",
    "violent_crime_rate": "~156 per 100k (low, but property crime is concern)",
    "best_neighborhoods": [
      "Northwest Crossing",
      "Awbrey Butte",
      "Old Bend (Central District)",
      "Southwest Bend",
      "River West"
    ]
  },
  "walkability": {
    "city_walk_score": "32/100 (car-dependent)",
    "best_walkable_neighborhoods": [
      "Downtown Bend (75)",
      "Old Bend / Central District (65)",
      "Box Factory District (68)",
      "West Side (60)",
      "River West (58)"
    ]
  },
  "scenery": {
    "summary": "Absolutely stunning—Cascade Mountains dominate the skyline, Deschutes River runs through town, high desert landscape with ponderosa pines. Mount Bachelor (ski resort) is 22 miles away, Smith Rock State Park (world-class rock climbing) 30 miles. This is outdoor recreation heaven—hiking, mountain biking, skiing, paddling, climbing all world-class and accessible. Scenery is the draw here."
  },
  "climate": {
    "summary": "300+ days of sunshine but cold winters—highs in the 80s, lows down to 24°F. Dry, beautiful summers but winter is real (22 inches of snow). Oregon's 'sunny side' but still cold compared to mild climates. Cold nights year-round (desert). Better for those who prioritize sun over warmth.",
    "avg_summer_high": "83°F (low humidity)",
    "avg_winter_low": "24°F",
    "annual_snowfall": "22 inches (more in mountains)",
    "annual_sunny_days": "300+"
  },
  "culture": {
    "summary": "Bend culture IS outdoor recreation—this is a town of skiers, mountain bikers, climbers, paddlers, trail runners. Breweries everywhere (10+ craft breweries), food scene growing but small-town, outdoor gear shops, festivals (BendFilm, Pole Pedal Paddle). It's overwhelmingly white, affluent, outdoorsy transplants. Politically moderate—mix of environmentally-conscious liberals and libertarian conservatives. Culture is shallow beyond outdoor pursuits."
  },
  "pros": [
    "Unbeatable outdoor recreation access—skiing, biking, hiking, climbing at world-class level",
    "300+ days of sunshine with four true seasons",
    "Beautiful high desert mountain scenery",
    "Safe, clean, well-maintained small city",
    "Growing food scene and breweries (10+ craft breweries)",
    "Moderate politics (for Oregon)—environmentally progressive but not Portland-level",
    "Josh would be in heaven with outdoor access",
    "Dry climate—no Seattle rain"
  ],
  "cons": [
    "⚠️ DEALBREAKER: 91% white, 0.7% Black—Candace would face severe isolation",
    "Expensive for a small city (driven by outdoor recreation demand)",
    "Very car-dependent outside small downtown core",
    "Culture is one-dimensional (outdoor rec dominates everything)",
    "Small-town limitations—will feel tiny after 1-2 years",
    "Homogeneous population (white, affluent, outdoorsy)",
    "Growing homelessness/transient population concerns",
    "Limited diversity in food, arts, perspectives",
    "Oregon's racial history is problematic"
  ],
  "saturday": "You wake up in your Box Factory District loft to crystalline high desert sunshine and walk to Thump Coffee for espresso and pastries. By 8 AM, you're skinning up Mount Bachelor (if it's winter) or mountain biking Phil's Trail (if it's summer)—Bend is an outdoor playground 365 days a year. Back in town by noon, you grab lunch at Jackson's Corner (farm-to-table pizzas), then float the Deschutes River or climb at Smith Rock. Dinner is at 10 Barrel Brewing overlooking the river, surrounded by fit, outdoorsy, overwhelmingly white Oregonians. Bend is paradise for recreationists, but the homogeneity is inescapable. You'd live here for the mountains, not the people.",
  "food_scene": {
    "summary": "Bend's food scene is small-town but punching above its weight—farm-to-table ethos, 10+ craft breweries, and outdoor-loving chefs creating mountain-inspired menus. Very limited international/Mediterranean options due to size and demographics.",
    "mediterranean_options": [
      "Jackson's Corner (Mediterranean-inspired, wood-fired pizzas)",
      "Spork (eclectic, some Mediterranean fusion dishes)",
      "Zydeco Kitchen (Cajun with Mediterranean touches)"
    ],
    "farmers_markets": [
      "Bend Farmers Market (Wednesdays, May-September, NW Crossing)"
    ],
    "food_culture": "Bend food culture is craft beer-first—10 Barrel, Deschutes Brewery, Crux—with outdoor-fueled appetites. The food scene skews casual (tacos, burgers, pizza) with growing farm-to-table spots (Ariana, Jackson's Corner). Very white, very outdoorsy, limited ethnic diversity. Affordable for Oregon.",
    "grocery_quality": "Newport Avenue Market (local, upscale), Trader Joe's, Whole Foods, Natural Grocers. Solid for the size but limited international options."
  },
  "neighborhoods": [
    {
      "name": "Downtown Bend",
      "vibe": "Walkable core—boutiques, restaurants, breweries, Deschutes River access",
      "walk_score": "75/100",
      "median_rent_1br": "$1,800",
      "safety_rating": "high",
      "diversity_notes": "Most diverse (still overwhelmingly white), younger crowd",
      "why_for_them": "Most walkable, near river trails, restaurants. Best option if determined to try Bend. Still very white and small."
    },
    {
      "name": "Old Bend / Central District",
      "vibe": "Historic neighborhood with character homes, tree-lined streets",
      "walk_score": "65/100",
      "median_rent_1br": "$1,700",
      "safety_rating": "high",
      "diversity_notes": "Very white, family-oriented, established neighborhood",
      "why_for_them": "Walkable, character, near downtown. Safe and charming but homogeneous. Close to trails and river."
    },
    {
      "name": "Box Factory District",
      "vibe": "Former industrial area turned trendy—breweries, restaurants, bike shops",
      "walk_score": "68/100",
      "median_rent_1br": "$1,750",
      "safety_rating": "medium-high",
      "diversity_notes": "Younger, outdoor industry workers, very white",
      "why_for_them": "Trendy, walkable, near Deschutes River Trail. Josh would like the vibe. Limited diversity."
    },
    {
      "name": "Northwest Crossing",
      "vibe": "Newer master-planned community—trails, parks, family-friendly",
      "walk_score": "50/100",
      "median_rent_1br": "$1,850",
      "safety_rating": "high",
      "diversity_notes": "Affluent, white, suburban feel",
      "why_for_them": "Safe, near trails, new construction. Too suburban and cookie-cutter for their goals. Not recommended."
    },
    {
      "name": "River West",
      "vibe": "Residential along Deschutes River—outdoor access, established",
      "walk_score": "58/100",
      "median_rent_1br": "$1,650",
      "safety_rating": "high",
      "diversity_notes": "Very white, family-focused",
      "why_for_them": "Direct river access, trails, safe. More residential. Still very homogeneous. Decent value."
    }
  ]
}
