{
  "name": "Savannah, GA",
  "slug": "savannah-ga",
  "region": "Deep South",
  "tagline": "Historic coastal charm with a substantial Black community—but Southern politics and crime require honest evaluation",
  "population": "390,000 metro",
  "scores": {
    "diversity_climate": 4,
    "safety": 5,
    "political_moderation": 5,
    "cost_of_living": 9,
    "walkability": 8,
    "scenic_beauty": 9,
    "climate": 10,
    "culture": 8
  },
  "cost_of_living": {
    "index_vs_national": "7% below national average",
    "median_rent_1br": "$1,570",
    "median_rent_2br": "$1,730",
    "vs_la_savings": "$600-1,200/month compared to LA"
  },
  "diversity": {
    "summary": "DIVERSE BUT PARALLEL: Savannah is 54% Black, so Candace would not be isolated numerically. Interracial couples report 'no problems' and 'we have not experienced racism.' But the critical issue is integration vs. coexistence — Black and white Savannahians largely live in different neighborhoods, attend different churches, socialize in parallel. It's not hostile, it's just separate. You'd likely live in a 'Black neighborhood' or a 'white neighborhood,' not an integrated one. The Historic District and SCAD-influenced areas have more mixing, but deeper Savannah runs on Old South social patterns. For an interracial couple, the issue isn't safety or acceptance — it's whether you'd find a community that reflects your relationship, or navigate between two separate communities.",
    "diversity_index": "~37% White, 54% Black, 3% Hispanic, 2% Asian — majority Black but deeply segregated; parallel rather than integrated",
    "notable": "54% Black but parallel communities rather than integrated ones; interracial couples not harassed but true social mixing is limited; Old South dynamics persist beneath the charm"
  },
  "safety": {
    "summary": "⚠️ HONEST CONCERN: Crime has been elevated but improving. Violent crime dropped 20% in 2024 (834 violent crimes vs 982 in 2018), but still higher than national average. Chance of victimization is 1 in 46 overall. Safe neighborhoods exist—Historic District, Victorian District, Ardsley Park are relatively low-crime—but awareness is required. Candace's safety threshold (San Diego baseline) needs serious consideration here.",
    "violent_crime_rate": "~600 per 100k (declining but still elevated; down 20% in 2024)",
    "best_neighborhoods": [
      "Ardsley Park / Chatham Crescent",
      "Historic District (Forsyth Park area)",
      "Victorian District",
      "Wilmington Island",
      "Isle of Hope"
    ]
  },
  "walkability": {
    "city_walk_score": "47/100 (car-dependent overall)",
    "best_walkable_neighborhoods": [
      "Historic District / Downtown (85+)",
      "Victorian District-East (83)",
      "Victorian District-West (82)",
      "Starland District (78)",
      "Forsyth Park area (80)"
    ]
  },
  "scenery": {
    "summary": "Stunning coastal Southern beauty—Spanish moss, live oaks, historic squares, Forsyth Park fountain, River Street along the Savannah River, nearby Tybee Island beaches (18 miles). Quintessential Southern Gothic architecture. Summer heat/humidity is real, but spring and fall are gorgeous."
  },
  "climate": {
    "summary": "Warm-weather paradise: mild winters that rarely freeze, hot summers (90s with humidity). No snow—maybe a dusting once a decade. If you love warmth and want to avoid harsh cold, this delivers. Spring (March-May) and fall (Oct-Nov) are beautiful. Over 200 sunny days annually.",
    "avg_summer_high": "91°F (feels hotter with humidity)",
    "avg_winter_low": "42°F",
    "annual_snowfall": "0.04 inches (essentially never)",
    "annual_sunny_days": "216"
  },
  "culture": {
    "summary": "Rich blend of Southern history, Gullah-Geechee heritage, SCAD (art school) creative energy, and tourism. Historic squares, ghost tours, First Friday art walks, strong food scene (Low Country cuisine, seafood, soul food), live music. Southern hospitality is real. However, be aware: Georgia politics trend conservative (though Savannah proper leans Democratic). Complex relationship with Confederate history."
  },
  "pros": [
    "Majority-Black city—Candace would be part of the cultural majority",
    "Very affordable compared to LA (9% below national average)",
    "Beautiful historic architecture and coastal scenery",
    "Walkable downtown with character and charm",
    "Strong Black community, churches, cultural institutions",
    "Access to beaches (Tybee Island 18 miles)",
    "Mild winters—no shoveling snow",
    "Growing arts scene (SCAD influence)"
  ],
  "cons": [
    "⚠️ Crime concerns—improving but still elevated, especially for Candace's safety baseline",
    "Georgia state politics are conservative (though city itself is moderate/liberal)",
    "Summer heat and humidity are oppressive (May-September)",
    "Limited walkability outside historic core—car still needed",
    "Deep South cultural dynamics—progress exists but Confederate monuments, etc. are present",
    "Smaller job market than major metros (tourism/service heavy)",
    "Hurricane risk (coastal Georgia)",
    "May feel small after 1-2 years (under 400k metro)"
  ],
  "saturday": "You wake up in the Victorian District to Spanish moss swaying outside your window and walk to The Collins Quarter for avocado smash and flat whites. The morning is spent wandering Forsyth Park and the Historic District's squares—live oaks dripping with moss, fountains, architecture that makes you stop and stare. By afternoon, you drive to Tybee Island for beach time and fresh shrimp, then back to Starland District for gallery-hopping. Dinner is at Olympia Cafe on River Street—Greek food overlooking the Savannah River as cargo ships glide past. Evening finds you at a SCAD student art show or sipping cocktails at a rooftop bar, the humid night air thick with possibility. Savannah feels like nowhere else—haunted, beautiful, and unapologetically Southern.",
  "food_scene": {
    "summary": "Savannah's food scene blends Low Country tradition (shrimp and grits, she-crab soup, fried green tomatoes) with SCAD's international student influence and a growing chef-driven movement. The city eats well, though it's smaller and more Southern-focused than other metros on this list.",
    "mediterranean_options": [
      "Olympia Cafe (River Street—authentic Greek, river views)",
      "Troy Mediterranean Cuisine (family-owned, highly rated)",
      "Yia Yia Kitchen (Greek specialties)",
      "Casablanca Mediterranean Grill",
      "It's Greek To Me (casual, affordable)"
    ],
    "farmers_markets": [
      "Forsyth Park Farmers Market (Saturdays year-round)",
      "Starland Yard Market (occasional, local vendors)",
      "Savannah Farmers Market (seasonal)"
    ],
    "food_culture": "Savannah's food culture is deeply rooted in Gullah-Geechee heritage and Low Country cooking—seafood, rice dishes, soul food. The city has strong seafood (Desposito's, Boar's Head), classic Southern (Mrs. Wilkes' Dining Room), and emerging fine dining (The Grey, Local 11ten). SCAD students add international variety, but this is the Deep South—fried food and sweet tea reign.",
    "grocery_quality": "Whole Foods, Trader Joe's, Brighter Day Natural Foods Market (co-op), Publix. Solid grocery access for the city size, but fewer specialty international options than larger metros."
  },
  "neighborhoods": [
    {
      "name": "Historic District / Downtown",
      "vibe": "Iconic Savannah—cobblestones, squares, tourists, historic homes",
      "walk_score": "85/100",
      "median_rent_1br": "$1,800",
      "safety_rating": "medium-high",
      "diversity_notes": "Very diverse, touristy, mixed residential/commercial",
      "why_for_them": "Most walkable area, gorgeous architecture, near everything. Touristy feel may get old. Pricier but still affordable vs LA. Great for short-term adventure."
    },
    {
      "name": "Victorian District",
      "vibe": "Residential neighborhood south of downtown—ornate Victorian homes, local feel",
      "walk_score": "82/100",
      "median_rent_1br": "$1,600",
      "safety_rating": "medium-high",
      "diversity_notes": "Diverse, mix of students (SCAD), families, young professionals",
      "why_for_them": "Walkable, near Forsyth Park, more residential than downtown. Great for urban living without full tourist saturation. Safe and charming."
    },
    {
      "name": "Starland District",
      "vibe": "Savannah's arts district—galleries, cafes, indie shops, creative energy",
      "walk_score": "78/100",
      "median_rent_1br": "$1,550",
      "safety_rating": "medium",
      "diversity_notes": "Diverse, artsy, younger crowd, gentrifying",
      "why_for_them": "Josh would love the walkability and bohemian vibe. Less polished than Historic District. Growing neighborhood with edge and character."
    },
    {
      "name": "Ardsley Park / Chatham Crescent",
      "vibe": "Upscale residential—tree-lined streets, historic homes, family-oriented",
      "walk_score": "68/100",
      "median_rent_1br": "$1,700",
      "safety_rating": "high",
      "diversity_notes": "Less diverse, affluent, family-focused",
      "why_for_them": "Safest neighborhood option. Beautiful, quiet, near Daffin Park. Less walkable but high quality of life. Good compromise for safety priority."
    },
    {
      "name": "Thomas Square / Midtown",
      "vibe": "Transitional neighborhood—mix of historic homes, renovations, neighborhood feel",
      "walk_score": "72/100",
      "median_rent_1br": "$1,500",
      "safety_rating": "medium",
      "diversity_notes": "Diverse, community-oriented, active neighborhood association",
      "why_for_them": "Affordable, walkable, authentic Savannah feel. Renovation opportunities. Near Starland. Good value but requires block-by-block research."
    }
  ]
}